{
	"url": "https://www.ycombinator.com/companies/razorpay",
	"html": "<div data-page=\"{&quot;component&quot;:&quot;ycdc_new/pages/Companies/ShowPage&quot;,&quot;props&quot;:{&quot;currentUser&quot;:null,&quot;company&quot;:{&quot;id&quot;:827,&quot;slug&quot;:&quot;razorpay&quot;,&quot;name&quot;:&quot;Razorpay&quot;,&quot;batch_name&quot;:&quot;W15&quot;,&quot;small_logo_url&quot;:&quot;https://bookface-images.s3.amazonaws.com/small_logos/b6a6aaf9a84fa4b7ddb53cabda7443c142a5a154.png&quot;,&quot;one_liner&quot;:&quot;India&apos;s only full-stack financial solutions company for businesses.&quot;,&quot;website&quot;:&quot;https://razorpay.com&quot;,&quot;long_description&quot;:&quot;The journey of building Razorpay started in 2014, when Harshil Mathur (CEO \\u0026 Co-Founder) and Shashank Kumar (MD \\u0026 Co-Founder) witnessed the dismal state of the online payments industry in India then and understood that they have a larger and more important issue to solve. And That was democratizing online payments for Indian businesses, particularly the underserved market, Startups and SMEs. Over the last 9 years, Razorpay has evolved from a single-product company to a multi-product company, from an online payment gateway to India&#x2019;s only full-stack financial solutions company, offering payments and banking solutions to businesses.  Razorpay today is transforming age-old complexities and changing every known paradigm of money movement for disruptive businesses.\\r\\n\\r\\nOver the last couple of years, Razorpay&#x2019;s growth has evolved to be an index of India&#x2019;s digital economy. From a kirana shop in Kashmir collecting payments on our POS device to a textile exporter in Kanyakumari accepting dollars through our International Payments product, Razorpay has revolutionised how businesses have traditionally transacted and interacted with money. \\r\\n\\r\\nRazorpay became the first and only Indian fintech to build a full-stack international Payment Gateway &#x2018;Curlec by Razorpay&#x2019; and evolved into a comprehensive provider of payment solutions, leveraging the synergy between cutting-edge technological capabilities and a profound understanding of the local payment ecosystem. The introduction of the new Curlec Payment Gateway aims to cater to a wide spectrum of businesses, expanding its reach to over 5,000 establishments. \\r\\n\\r\\nBe it for international expansion or solving for Indian businesses, for Razorpay, the customer has always been at the core of all disruption, from addressing evolving needs to delivering new solutions. This hyperfocus helped bring Razorpay&#x2019;s several industry-first innovations into the market since 2014. Razorpay became the first to launch a completely digital on-boarding process for startups, first to launch support for UPI, first to launch support for Bharath QR, first to introduce recurring payments for businesses through Razorpay Route, automating payment receipts and later automate payouts and making the entire process seamless and optimized and many more were introduced aling the way. Other firsts include: - First to launch India&#x2019;s Multi-Network Tokenisation solution, TokenHQ - Razorpay became India&#x2019;s first payment gateway to support credit cards on UPI - Razorpay also became India&#x2019;s largest omnichannel payment gateway for businesses post acquiring Ezetap which is India&#x2019;s leading offline POS company that was founded with the aim to simplify the in-person offline payments experience.\\r\\n\\r\\nOver the years, Razorpay&#x2019;s valuation has jumped from &#x24;1 billion to &#x24;7.5 billion and has added a host of marquee investors to its captable. Razorpay is also the second Indian company to be a part of Silicon Valley&#x2019;s largest tech accelerator, Y Combinator. Marquee investors such as Lone Pine Capital, Alkeon Capital, TCV, GIC, Tiger Global, Sequoia Capital India, Ribbit Capital, Matrix Partners, Salesforce Ventures, Y Combinator, and MasterCard have invested a total of &#x24;741.5 Mn through Series A, B, C, D, E and F funding. The last financing round of Series F led the company&#x2019;s valuation to &#x24;7.5 Billion signaling one of the fastest increases in valuation for an Indian Unicorn. \\r\\n\\r\\nRazorpay has also made acquisitions with like-minded companies over the last 9 years. In total, till date, Razorpay has made eight acquisitions, Billme in 2023 - A Digital invoice and customer Engagement, Ezetap in 2022 - India&#x2019;s leading offline POS company, PoshVine in 2022 - India&#x2019;s leading loyalty and reward management platform, IZealiant in 2022 - A mobile-first, API-enabled, and cloud-ready payment solution and made its first international foray in South-East Asia by announcing its acquisition of Curlec in 2022 - A recurring payments platform. TeraFin Labs in 2021 - the AI-based SaaS platform that facilitates digital financing solutions, Opfin (Now RazorpayX Payroll) in 2019 -  The payroll management solution and Thirdwatch in 2019, the first acquisition - The AI-powered fraud detection platform.\\r\\n\\r\\nAll these efforts are being done in collaboration with banks, regulators, and stakeholders so that India can build a better place for small and big businesses. Today, Razorpay powers online payments for 76 Of 100 startup unicorns and millions of businesses in India. The core premise of what Razorpay was founded in 2014 and what it is today hasn&#x2019;t changed. It is to make money movement simpler and easier, whether it is for businesses to receive money, send money, or manage money. \\r\\n\\r\\n&quot;,&quot;tags&quot;:[&quot;banking-as-a-service&quot;,&quot;fintech&quot;,&quot;payments&quot;,&quot;india&quot;],&quot;ycdc_status&quot;:&quot;Active&quot;,&quot;logo_url&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/logos/48a842c412c82e39ae5685642d749cd23e014c1a.png?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=8bf92af8e0d24c1f1d82ed3d81e85eb5d3a35c3d8e3fd90c9a31bcfffa890d1e&quot;,&quot;year_founded&quot;:2014,&quot;team_size&quot;:2700,&quot;location&quot;:&quot;Bengaluru, India&quot;,&quot;city&quot;:&quot;Bengaluru&quot;,&quot;city_tag&quot;:null,&quot;country&quot;:&quot;IN&quot;,&quot;linkedin_url&quot;:&quot;https://www.linkedin.com/company/razorpay/&quot;,&quot;twitter_url&quot;:&quot;https://twitter.com/razorpay&quot;,&quot;fb_url&quot;:&quot;https://facebook.com/razorpay&quot;,&quot;cb_url&quot;:&quot;https://www.crunchbase.com/organization/razorpay&quot;,&quot;github_url&quot;:&quot;https://github.com/razorpay&quot;,&quot;free_response_question_answers&quot;:[{&quot;id&quot;:&quot;1&quot;,&quot;answer&quot;:&quot;(Attributed to Harshil Mathur, CEO \\u0026 CoFounder of Razorpay)I met Shashank during our time at IIT Roorkee, and our collaboration began there. We worked on numerous projects together, fueled by our shared passion for coding. In fact, many of the codes we wrote during our college days are still the backbone of Razorpay&apos;s operations today. Our bond extended beyond academics; we were instrumental in founding SDS Labs, the software development section of our alma mater. After graduation, our paths diverged geographically, with Shashank moving to the USA to join Microsoft, while I ventured to the Middle East to work with Schlumberger. Despite the distance, our friendship remained strong, and we continued to collaborate on various side projects.One pivotal moment came in 2014 when we embarked on a crowdsourcing platform project to collect online donations for a cause. However, we encountered significant hurdles with existing payment gateway systems. This experience opened our eyes to the challenges faced by Indian businesses, particularly Startups and small businesses, in accepting payments online.Determined to address this gap, we decided to establish Razorpay, driven by a mission to democratize payments for startups and SMEs. Armed with research and fueled by our passion for solving real-world problems, we set out to create a platform that offers simple, affordable, and secure payment solutions.For us, perseverance has been a way of life. We are relentless in our pursuit of identifying and solving the financial challenges faced by small businesses. Whether it&apos;s rain or shine, we push through obstacles until we find viable solutions. This resilience has been the cornerstone of Razorpay&apos;s growth, propelling us from 10,000 partner businesses in 2017 to over 5 million today.&quot;,&quot;question&quot;:&quot;How did your company get started? (i.e., How did the founders meet? How did you come up with the idea? How did you decide to be a founder?)&quot;},{&quot;id&quot;:&quot;2&quot;,&quot;answer&quot;:&quot;(Attributed to Harshil Mathur, CEO \\u0026 CoFounder of Razorpay)Long before we applied to YC, Shashank and I had been fans. Hacker News was our go-to source for information on building startups, and a few months after we started working on Razorpay, we saw an announcement on Hacker News about the YC application period opening up.At that point, Razorpay hadn&apos;t launched and we weren&apos;t remotely confident about getting in. The YC application process is pretty thorough; there are tough questions that force you to be crystal clear about who you are as a company. Things like how will you differentiate yourself from the competition; how will you acquire market share; how big is your market, and how big will you be in a few years from now? All of those are important questions to discuss internally, and so at a minimum, we thought applying would help us zero in on succinct, precise answers to give both of us clarity, even if we didn&apos;t get in.But thankfully our efforts paid off, and we did make the cut. When Shashank Kumar and I found out in late 2014 we&apos;d been accepted into Y Combinator, we figured we&apos;d need to split our time between running Razorpay in Bangalore and joining our fellow founders in Silicon Valley. It was only a few months after we had launched Razorpay and we were afraid of abandoning our customers, even for a bit, just as we were getting off the ground.&#xa0;Ignoring that temptation and spending the full three months of YC in Mountain View was one of the best decisions we ever made.It was a good call to stay in US and not fly back and forth to India, because if we had, we&apos;d have missed out on the full benefit of YC &#x2014; spending valuable time with the other founders in our batch, meeting successful alumni and building relationships throughout the YC community, and getting mentored by YC partners and other investors.Now, 9 years later, we couldn&apos;t be more proud to be [YC&apos;s first Indian unicorn](https://techcrunch.com/2020/10/11/razorpay-100-million-billion-valuation-unicorn/). I can honestly say that although we had to work harder during those three months than at any other time in my life, with countless 20-hour days attending YC sessions and dinners and then working late nights supporting our customers in India, I wouldn&apos;t change a thing.&#xa0;That&apos;s why the best advice I can give to any Indian founder considering YC is to go all in on it the same way we did. The priceless, irreplaceable learning happens when you least expect it &#x2014; during a late-night drink with another founder in your batch, maybe, or in a spur-of-the-moment meeting with a YC partner. You can&apos;t say you&apos;ll do 60% or 80% of the YC program, because you can&apos;t know where 60% or 80% of YC&apos;s advantage is. So figure out how to get 100% of the benefit of it; it&apos;ll be hard, and exhausting, definitely, but you will never regret it.&quot;,&quot;question&quot;:&quot;How did you decide to apply to Y Combinator? What was your experience applying, going through the batch, and fundraising at demo day?&quot;},{&quot;id&quot;:&quot;3&quot;,&quot;answer&quot;:&quot;&quot;,&quot;question&quot;:&quot;How have you kept in touch with the YC community and continued to use YC resources \\u0026 programs since the batch ended?&quot;},{&quot;id&quot;:&quot;4&quot;,&quot;answer&quot;:&quot;&quot;,&quot;question&quot;:&quot;What&apos;s the history of your company from getting started until the present day? What were the big inflection points?&quot;},{&quot;id&quot;:&quot;5&quot;,&quot;answer&quot;:&quot;In 2014, after discovering the dismal state of online payments in India Harshil and Shashank founded Razorpay, **India&#x2019;s first payment gateway built for Startups** a platform for a simple, affordable, and secure way for businesses to accept payments online. Progressing in the journey that started with payment acceptance, the company also witnessed a progressive acceptance and adoption of digital innovations. But what was surprising was while the big payment players in the market were catering to large businesses, smaller businesses needed immediate attention. In India, **MSMEs are the second largest employment-generating sector after agriculture and contribute around 31% to the nation&#x2019;s GDP**. One of the major challenges for SMEs \\u0026 Startups was the lack of technology infrastructure, especially for B2B payment technologies. There was a need for a comprehensive converged payment and banking solution that can help manage the entire money movement (from acceptance to disbursals) within an organisation.&#xa0;This particular thought gave birth to the launch of **Razorpay&#x2019;s neo-banking platform, RazorpayX, and lending platform Razorpay Capital.** The company now offers a single platform for businesses to manage the entire money flow within an organization. Eight years to now, **Razorpay evolved from being a payment gateway to India&#x2019;s first full-stack financial solutions company providing intelligent new-age payment and business banking solutions** to help Indian businesses address the entire length and breadth of their payment \\u0026 banking journey. The company believes that for the next phase of growth in the fintech industry, payment players need to **evolve beyond offering solutions for payment acceptance to managing the entire money flow (from acceptance to disbursements and everything in between). Hence, it is of supreme importance to recognize a market (SMEs \\u0026 Startups)**, identify challenges, and provide a holistic solution, at scale.&quot;,&quot;question&quot;:&quot;What is the core problem you are solving? Why is this a big problem? What made you decide to work on it?&quot;},{&quot;id&quot;:&quot;6&quot;,&quot;answer&quot;:&quot;**Razorpay is committed to building the central nervous system of digital India.** The company aims to change how payments and banking are done for small businesses in India and wants to create a benchmark for the entire world to follow.&#xa0;Razorpay today is India&#x2019;s leading and first full-stack financial solutions company that offers both payments and banking solutions for businesses on a single platform.&#xa0; The founding team always wanted to build a platform like this because of the single goal **- to help businesses spend less time managing compliance and operations and more time creating new products, pursuing new ideas, and thinking about how to scale. The company&#x2019;s vision continues to produce new idea and innovation that benefits millions of businesses even today.**&#xa0;Overall, the company wants to help make India economically more inclusive and is making strides toward that goal. Razorpay believes It&#x2019;s an exciting time of change and is creating history. Digitization is the lifeblood of any business. It impacts EVERYTHING a business does - from cash flow \\u0026 hiring to credit, investment \\u0026 expansion. Businesses can no longer think of digitization as an afterthought!&#xa0;The digital payments landscape has multiplied over the last decade. India has globally positioned itself as a benchmark in digital payments owing to its resilient payment infrastructure, market practices, and proliferation of digital payments across various segments. The adoption of digital payments in the MSME space has unlocked several efficiencies that have driven end-to-end transformation in how small businesses conduct their operations. **India today is amongst&#xa0;the fastest growing Fintech markets&#xa0;in the world**, being the&#xa0;3rd largest FinTech ecosystem, India has&#xa0;the highest Fintech adoption rate&#xa0;globally (87%).&#xa0;**Razorpay also believes \\u0026 foresees Indian fintech as the default service provider for the world that can make a difference by bringing customized digital solutions for customers beyond the geographies clubbed with best-in-class fintech technologies.**&quot;,&quot;question&quot;:&quot;What is your long-term vision? If you truly succeed, what will be different about the world?&quot;}],&quot;dday_video_url&quot;:null,&quot;dday_presenter_id&quot;:null,&quot;app_video_url&quot;:null,&quot;app_answers&quot;:[],&quot;ycdc_company_url&quot;:&quot;/companies/razorpay&quot;,&quot;company_photos&quot;:[{&quot;id&quot;:162,&quot;url&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/attachments/74cc0eb93855c18a52ffa4468facbd5d5a49f51c.png?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=63396e775c77b182c3c8c5c2699632ce50b56de624682e2d08bdc13693380ebd&quot;,&quot;photo_type&quot;:&quot;sign&quot;},{&quot;id&quot;:163,&quot;url&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/attachments/d0542247c32aa7d285a58ea7c30e930677376536.png?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=3c1304bc2c7912c820f8077b55a752ad89329e3248875e8197d4ccb86304337b&quot;,&quot;photo_type&quot;:&quot;team&quot;}],&quot;primary_group_partner&quot;:null,&quot;founders&quot;:[{&quot;user_id&quot;:7125,&quot;is_active&quot;:true,&quot;founder_bio&quot;:&quot;&quot;,&quot;full_name&quot;:&quot;Shashank Kumar&quot;,&quot;title&quot;:&quot;Founder&quot;,&quot;avatar_thumb_url&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/avatars/4bb41b492aebd9a1fb569c8e80c597ef82941171.jpg?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=929670df8842b75bce93d7145e54aa1e68516ed75e78eaeed89093cc222a8084&quot;,&quot;twitter_url&quot;:&quot;https://twitter.com/shashank_kr&quot;,&quot;linkedin_url&quot;:&quot;http://www.linkedin.com/in/kumarshashank&quot;,&quot;has_email&quot;:true,&quot;latest_yc_company&quot;:{&quot;name&quot;:&quot;Razorpay&quot;,&quot;href&quot;:&quot;/companies/razorpay&quot;}},{&quot;user_id&quot;:2139,&quot;is_active&quot;:true,&quot;founder_bio&quot;:&quot;&quot;,&quot;full_name&quot;:&quot;Harshil Mathur&quot;,&quot;title&quot;:&quot;Founder/CEO&quot;,&quot;avatar_thumb_url&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/avatars/b49464f5e793b8f6bd7b9bf571489df67252ac91.jpg?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=6ee18f68b69b77d30073969900b14c30f074db1304bbe01ac136299b9b47ad49&quot;,&quot;twitter_url&quot;:&quot;https://twitter.com/harshilmathur&quot;,&quot;linkedin_url&quot;:&quot;https://www.linkedin.com/pub/harshil-mathur/69/23a/127&quot;,&quot;has_email&quot;:true,&quot;latest_yc_company&quot;:{&quot;name&quot;:&quot;Razorpay&quot;,&quot;href&quot;:&quot;/companies/razorpay&quot;}}]},&quot;jobPostings&quot;:[{&quot;id&quot;:16046,&quot;title&quot;:&quot;Senior/Principal Engineer/Manager, Frontend Engineering&quot;,&quot;url&quot;:&quot;/companies/razorpay/jobs/Xpdifpfmk-senior-principal-engineer-manager-frontend-engineering&quot;,&quot;applyUrl&quot;:&quot;https://account.ycombinator.com/authenticate?continue=https%3A%2F%2Fwww.workatastartup.com%2Fapplication%3Fsignup_job_id%3D16046\\u0026defaults%5BsignUpActive%5D=true\\u0026defaults%5Bwaas_company%5D=827&quot;,&quot;location&quot;:&quot;Bangalore, Karnataka&quot;,&quot;askUs&quot;:false,&quot;type&quot;:&quot;Full-time&quot;,&quot;role&quot;:&quot;eng&quot;,&quot;roleSpecificType&quot;:&quot;Frontend&quot;,&quot;salaryRange&quot;:&quot;&quot;,&quot;equityRange&quot;:&quot;&quot;,&quot;minExperience&quot;:&quot;6+ years&quot;,&quot;minSchoolYear&quot;:&quot;&quot;,&quot;isIncomplete&quot;:false,&quot;companyUrl&quot;:&quot;/companies/razorpay&quot;,&quot;companyLogoUrl&quot;:&quot;https://bookface-images.s3.amazonaws.com/small_logos/b6a6aaf9a84fa4b7ddb53cabda7443c142a5a154.png&quot;,&quot;companyName&quot;:&quot;Razorpay&quot;,&quot;companyBatchName&quot;:&quot;W15&quot;,&quot;companyOneLiner&quot;:&quot;India&apos;s only full-stack financial solutions company for businesses.&quot;,&quot;hiringManager&quot;:{&quot;id&quot;:396858,&quot;first_name&quot;:&quot;Puneeth&quot;,&quot;last_name&quot;:&quot;Kumar&quot;,&quot;avatar_thumb&quot;:&quot;/avatars/thumb/missing.png&quot;,&quot;avatar_medium&quot;:&quot;/avatars/medium/missing.png&quot;},&quot;createdAt&quot;:&quot;about 5 years&quot;,&quot;lastActive&quot;:null},{&quot;id&quot;:77,&quot;title&quot;:&quot;Senior / Principal Engineers&quot;,&quot;url&quot;:&quot;/companies/razorpay/jobs/GQiEGb6ug-senior-principal-engineers&quot;,&quot;applyUrl&quot;:&quot;https://account.ycombinator.com/authenticate?continue=https%3A%2F%2Fwww.workatastartup.com%2Fapplication%3Fsignup_job_id%3D77\\u0026defaults%5BsignUpActive%5D=true\\u0026defaults%5Bwaas_company%5D=827&quot;,&quot;location&quot;:&quot;bangalore&quot;,&quot;askUs&quot;:false,&quot;type&quot;:&quot;Full-time&quot;,&quot;role&quot;:&quot;eng&quot;,&quot;roleSpecificType&quot;:&quot;Full stack&quot;,&quot;salaryRange&quot;:&quot;&quot;,&quot;equityRange&quot;:&quot;&quot;,&quot;minExperience&quot;:&quot;6+ years&quot;,&quot;minSchoolYear&quot;:&quot;&quot;,&quot;isIncomplete&quot;:false,&quot;companyUrl&quot;:&quot;/companies/razorpay&quot;,&quot;companyLogoUrl&quot;:&quot;https://bookface-images.s3.amazonaws.com/small_logos/b6a6aaf9a84fa4b7ddb53cabda7443c142a5a154.png&quot;,&quot;companyName&quot;:&quot;Razorpay&quot;,&quot;companyBatchName&quot;:&quot;W15&quot;,&quot;companyOneLiner&quot;:&quot;India&apos;s only full-stack financial solutions company for businesses.&quot;,&quot;hiringManager&quot;:{&quot;id&quot;:7125,&quot;first_name&quot;:&quot;Shashank&quot;,&quot;last_name&quot;:&quot;Kumar&quot;,&quot;avatar_thumb&quot;:&quot;https://bookface-images.s3.amazonaws.com/avatars/4bb41b492aebd9a1fb569c8e80c597ef82941171.jpg&quot;,&quot;avatar_medium&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/avatars/33faa5f81243a50d10a7e46aa37af6fc4e79611d.jpg?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=db075a2c04d9df7a235f06906a80fe9e854481571fc512452a485c1b641d2b93&quot;},&quot;createdAt&quot;:&quot;over 6 years&quot;,&quot;lastActive&quot;:null},{&quot;id&quot;:6516,&quot;title&quot;:&quot;Senior Infrastructure Engineer&quot;,&quot;url&quot;:&quot;/companies/razorpay/jobs/zUemCTA1N-senior-infrastructure-engineer&quot;,&quot;applyUrl&quot;:&quot;https://account.ycombinator.com/authenticate?continue=https%3A%2F%2Fwww.workatastartup.com%2Fapplication%3Fsignup_job_id%3D6516\\u0026defaults%5BsignUpActive%5D=true\\u0026defaults%5Bwaas_company%5D=827&quot;,&quot;location&quot;:&quot;Bengaluru&quot;,&quot;askUs&quot;:false,&quot;type&quot;:&quot;Full-time&quot;,&quot;role&quot;:&quot;eng&quot;,&quot;roleSpecificType&quot;:&quot;Devops&quot;,&quot;salaryRange&quot;:&quot;&quot;,&quot;equityRange&quot;:&quot;&quot;,&quot;minExperience&quot;:&quot;6+ years&quot;,&quot;minSchoolYear&quot;:&quot;&quot;,&quot;isIncomplete&quot;:false,&quot;companyUrl&quot;:&quot;/companies/razorpay&quot;,&quot;companyLogoUrl&quot;:&quot;https://bookface-images.s3.amazonaws.com/small_logos/b6a6aaf9a84fa4b7ddb53cabda7443c142a5a154.png&quot;,&quot;companyName&quot;:&quot;Razorpay&quot;,&quot;companyBatchName&quot;:&quot;W15&quot;,&quot;companyOneLiner&quot;:&quot;India&apos;s only full-stack financial solutions company for businesses.&quot;,&quot;hiringManager&quot;:{&quot;id&quot;:7125,&quot;first_name&quot;:&quot;Shashank&quot;,&quot;last_name&quot;:&quot;Kumar&quot;,&quot;avatar_thumb&quot;:&quot;https://bookface-images.s3.amazonaws.com/avatars/4bb41b492aebd9a1fb569c8e80c597ef82941171.jpg&quot;,&quot;avatar_medium&quot;:&quot;https://bookface-images.s3.us-west-2.amazonaws.com/avatars/33faa5f81243a50d10a7e46aa37af6fc4e79611d.jpg?X-Amz-Algorithm=AWS4-HMAC-SHA256\\u0026X-Amz-Credential=ASIAQC4NIECAAE2EWVEW%2F20241009%2Fus-west-2%2Fs3%2Faws4_request\\u0026X-Amz-Date=20241009T182128Z\\u0026X-Amz-Expires=3600\\u0026X-Amz-Security-Token=IQoJb3JpZ2luX2VjEAoaCXVzLXdlc3QtMiJIMEYCIQDBgJogyojOoZqdNpjXm56QXTlk77Bl9SA6nC2BdCRNAQIhANh9NcqCIN8hn5wMECdlhfstNwY3bTDN8qoNAhEckiUQKuUDCGMQABoMMDA2MjAxODExMDcyIgzdlNlDIiShYegx2doqwgNLj5FM8XugkkMTaTdszgD7SdcXlE1SB0uXLyTYuq3RndoragtkdKWtXCJazJ8eM4iDa6Q%2BKTaBILH8IdzbDf6I%2BKYEvC%2FPAhyfpAEkM9skmKK3kf%2FMVswZcTkzyQgQLaLYm8Bc4JJb99gFq4hHca23e9yjtN5SXco8cIpSFvm%2FGsFKYSSgYgBDFaLr3q74q9feNWiptH8i5TIQGmzNz8AzkMKY51VyQ7XMpeAzs8LnScwJR40RW%2FKqMEGTKVHNMRPxbZhHTKPilEb6QkhWd7suEgnuptd2Rfeb3qqRI9G1Fj%2Fs%2Btb7MFarjwS2zIljv9XN1pG5wg1at5PJjiX9nTwqrs5ObBm2zVKuXygBgBfCathfTslOrs%2BUjFMpcf9w8hc3PVN3nShFsHUn%2BBuOf5Tr3iANdjl5BPYCszIQerWhHcj%2FjNxBt9K7QiPH9%2FPEk2TgCPhq38%2BtqFAyl2aqwZWdRqTOk4MIRM5G6KQ6hdiudmo8LX0mh42M8S2GJ0EHUCErScVvkCXhFT0jpPwY7JReO52H85%2BfHP6ggsDSuSAgLFoRcjyU4HyYFb2uMNe%2Fzyrz6jn6MHY18xjdZbhX4uAu5ckwwYebuAY6pAGCYUcFGvJ2kQEft90Z6%2F%2FmArdxAUTIjlunVPIQ4bx1i4CbwFpQjPtEp771%2F82bdpgbA3AqeJSoRz%2FApIKlGzavEJ2jL42Q39dU%2BfuSiKreDAR7Xrdf0Wf591L4RIm%2BvC%2B7tlPokxHx9GOtUGqlKp9oic3kZzkwN%2BldbpgP43%2FBRtgW%2B97XRkW5X1i5qOWGdXX58P3deG30jgKW5xVLQpuX5blURg%3D%3D\\u0026X-Amz-SignedHeaders=host\\u0026X-Amz-Signature=db075a2c04d9df7a235f06906a80fe9e854481571fc512452a485c1b641d2b93&quot;},&quot;createdAt&quot;:&quot;over 6 years&quot;,&quot;lastActive&quot;:null}],&quot;jobsUrl&quot;:&quot;https://bookface.ycombinator.com/workatastartup&quot;,&quot;newsItems&quot;:[{&quot;title&quot;:&quot;et startup of the year razorpay: ET Startup Awards 2022: Razorpay wins Startup of the Year award - The Economic Times&quot;,&quot;url&quot;:&quot;https://economictimes.indiatimes.com/tech/startups/et-startup-awards-2022-razorpay-wins-startup-of-the-year-award/articleshow/95185680.cms&quot;,&quot;date&quot;:&quot;Nov 07, 2022&quot;},{&quot;title&quot;:&quot;Razorpay Helps FinTech HostBooks Raise &#x24;3M | PYMNTS.com&quot;,&quot;url&quot;:&quot;https://www.pymnts.com/news/investment-tracker/2022/razorpay-helps-fintech-hostbooks-raise-3m/&quot;,&quot;date&quot;:&quot;Jun 10, 2022&quot;},{&quot;title&quot;:&quot;YC-backed Indian fintech unicorn enters SEA&quot;,&quot;url&quot;:&quot;https://www.techinasia.com/ycbacked-fintech-unicorn-razorpay-enters-sea&quot;,&quot;date&quot;:&quot;Feb 08, 2022&quot;},{&quot;title&quot;:&quot;Indian fintech giant Razorpay valued at &#x24;7.5 billion in &#x24;375 million funding &#x2013; TechCrunch&quot;,&quot;url&quot;:&quot;https://techcrunch.com/2021/12/19/indian-fintech-giant-razorpay-valued-at-7-5-billion-in-375-million-funding/&quot;,&quot;date&quot;:&quot;Dec 19, 2021&quot;},{&quot;title&quot;:&quot;India&#x2019;s Razorpay launches faster checkout feature, tops &#x24;60 billion TPV &#x2013; TechCrunch&quot;,&quot;url&quot;:&quot;https://techcrunch.com/2021/12/08/india-razorpay-launches-faster-checkout-feature-tops-60-billion-tpv/&quot;,&quot;date&quot;:&quot;Dec 08, 2021&quot;}],&quot;newsUrl&quot;:&quot;https://bookface.ycombinator.com/company/827/company_news&quot;,&quot;launches&quot;:[],&quot;editUrl&quot;:&quot;https://bookface.ycombinator.com/company/827/edit&quot;,&quot;editUserUrl&quot;:&quot;https://bookface.ycombinator.com/edit_user_profile&quot;,&quot;createProfileUrl&quot;:&quot;https://account.ycombinator.com/authenticate?continue=https%3A%2F%2Fwww.workatastartup.com%2Fapplication\\u0026defaults%5BsignUpActive%5D=true&quot;,&quot;signedIn&quot;:false,&quot;showDirectApply&quot;:true,&quot;waasDirectoryUrl&quot;:&quot;https://www.workatastartup.com/companies&quot;,&quot;investorSubdomain&quot;:false,&quot;userCanRequestEmails&quot;:false},&quot;url&quot;:&quot;/companies/razorpay&quot;,&quot;version&quot;:null,&quot;rails_context&quot;:{&quot;railsEnv&quot;:&quot;production&quot;,&quot;inMailer&quot;:false,&quot;i18nLocale&quot;:&quot;en&quot;,&quot;i18nDefaultLocale&quot;:&quot;en&quot;,&quot;href&quot;:&quot;https://www.ycombinator.com/companies/razorpay&quot;,&quot;location&quot;:&quot;/companies/razorpay&quot;,&quot;scheme&quot;:&quot;https&quot;,&quot;host&quot;:&quot;www.ycombinator.com&quot;,&quot;port&quot;:null,&quot;pathname&quot;:&quot;/companies/razorpay&quot;,&quot;search&quot;:null,&quot;httpAcceptLanguage&quot;:&quot;en-US&quot;,&quot;applyBatchLong&quot;:&quot;Winter 2025&quot;,&quot;applyBatchShort&quot;:&quot;W2025&quot;,&quot;applyDeadlineShort&quot;:&quot;November 12&quot;,&quot;ycdcRetroMode&quot;:true,&quot;currentUser&quot;:null,&quot;serverSide&quot;:false},&quot;id&quot;:&quot;ycdc_new/pages/Companies/ShowPage-react-component-d885f7d1-1218-4ae9-8bbf-7141da10f1df&quot;,&quot;server_side&quot;:false}\" data-reactroot id=\"ycdc_new/pages/Companies/ShowPage-react-component-d885f7d1-1218-4ae9-8bbf-7141da10f1df\"></div>"
}